#UseHook

sc07B::Send,{vk5Bsc15B}  ; 左◇ → Windows
sc07B & v::  ; 左◇ + v → クリップボード履歴
  Send,{vk5Bsc15B down}{v down}  ; Windows + v を押す
  Send,{v up}{vk5Bsc15B up}      ; v + Windows を離す
return
^]::  ; Ctrl + \
  Send,{vkF3sc029}  ; 半角/全角
return

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; 1段目
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
VKF4::Send,{``}    ;         半角/全角     -> `
+VKF4::Send,{~}    ; Shift + 半角/全角     -> ~
+2::Send,{@}       ; Shift + 2         ["] -> @
+6::Send,{^}       ; Shift + 6         [&] -> ^
+7::Send,{&}       ; Shift + 7         ['] -> &
+8::Send,{*}       ; Shift + 8         [(] -> *
+9::Send,{(}       ; Shift + 9         [)] -> (
+0::Send,{)}       ; Shift + 0         [ ] -> )
+-::Send,{_}       ; Shift + -         [=] -> _
^::Send,{=}        ;                   [^] -> =
+^::Send,{+}       ; Shift + ^         [~] -> +

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; 2段目
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
@::[              ;                   [@] -> [
+@::{             ; Shift + @         [`] -> {
[::]              ;                   [[] -> ]
+[::Send,{}}      ; Shift + [         [{] -> }

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; 3段目
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
+;::Send,{:}      ; Shift + ;         [+] -> :
:::Send,{'}       ;                   [:] -> '
*::Send,{"}       ; Shift + :         [*] -> "
+]::|             ; Shift + ]         [}] -> |
]::\              ;                   []] -> \

; Emacsキーバインド
#include %A_ScriptDir%\EmacsKeymap.ahk

